"use strict";

// 1. Підрахуй суму всіх чисел в заданому користувачем діапазоні.
let start = +prompt("Введи початок діапазону:");
let end = +prompt("Введи кінець діапазону:");

let sum = 0;

for (let i = start; i <= end; i++) {
  sum += i;
}

alert(`Сума всіх чисел від ${start} до ${end} = ${sum}`);

// 2. Запитай у користувача 2 числа і знайди найбільший спільний дільник.
let firstNumb = +prompt("Введи перше число:");
let secondNumb = +prompt("Введи друге число:");
let commonNumb = 1;

for (let i = 1; i <= Math.min(firstNumb, secondNumb); i++) {
  if (firstNumb % i === 0 && secondNumb % i === 0) {
    commonNumb = i;
  }
}
alert(`Найбільший спільний дільник = ${commonNumb}`);

// 3. Запитай у користувача число і виведи всі дільники цього числа.
let numb = +prompt("Введи число:");
let allNumb = "";

for (let i = 1; i <= numb; i++) {
  if (numb % i === 0) {
    allNumb += i + " ";
  }
}
alert(`Дільники числа ${numb}: ${allNumb}`);

// 4. Запитай у користувача 10 чисел і порахуй, скільки він ввів додатніх, від’ємних і нулів. При цьому також порахуй, скільки з них парних і непарних. Виведи статистику на екран. Враховуй, що достатньо однієї змінної (не 10) для введення чисел користувачем.
let positive = 0;
let negative = 0;
let zeros = 0;
let even = 0;
let odd = 0;

for (let i = 1; i <= 10; i++) {
  let numbTen = +prompt(`Введи число: ${i}`);

  if (numbTen > 0) {
    positive++;
  } else if (numbTen < 0) {
    negative++;
  } else if (numbTen === 0) {
    zeros++;
  }

  if (numbTen % 2 === 0) {
    even++;
  } else {
    odd++;
  }
}

alert(`Позитивних: ${positive}
  Негативних: ${negative}
  Нулів: ${zeros}
  Парних: ${even}
  Непарних: ${odd}`);

// 5. Зацикли відображення днів тижня таким чином: «День тижня. Хочеш побачити наступний день? » і так до тих пір, поки користувач натискає OK.
let days = [
  "Понеділок",
  "Вівторок",
  "Середа",
  "Четвер",
  "П’ятниця",
  "Субота",
  "Неділя",
];

let i = 0;

while (confirm(`${days[i]}. Хочеш побачити наступний день?`)) {
  i++;
  if (i === days.length) {
    i = 0;
  }
}

// 6. Гра «Вгадай число». Запропонуй користувачеві загадати число від 0 до 100 і відгадай його наступним способом: кожну ітерацію циклу діли діапазон чисел навпіл, записуй результат в N і питай у користувача «Ваше число> N, <N або == N?». Залежно від того що вказав користувач, зменшуй діапазон. Початковий діапазон від 0 до 100, поділи навпіл і отримай 50. Якщо користувач вказав, що його число> 50, то зміни діапазон на від 50 до 100. І так до тих пір, поки користувач не вибере == N (буде корисним почитати про алгоритм: "бінарний пошук").

alert("Загадай число від 0 до 100");

let minNumber = 0;
let maxNumber = 100;

while (true) {
  let guess = Math.floor((minNumber + maxNumber) / 2);
  let reply = prompt(
    `Твоє число більше, менше чи дорівнює ${guess}? (>, <, =)`
  );

  if (reply === "=") {
    alert(`Твоє число: ${guess}`);
    break;
  } else if (reply === ">") {
    minNumber = guess + 1;
  } else if (reply === "<") {
    maxNumber = guess - 1;
  }
}
